; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v7 - type_1 ?v8 - type_2)
 	      (pred_2 ?v5 - object ?v8 - type_2)
	      (pred_1 ?v7 - type_1 ?v2 - type_3)
	      (pred_3 ?v7 - type_1 ?v5 - object ?v2 - type_3))

   (:action op_3
       :parameters  (?v7 - type_1 ?v1 ?v4 - type_2)
       :precondition (and  (pred_4 ?v7 ?v1))
       :effect (and  (pred_4 ?v7 ?v4)
		     (not (pred_4 ?v7 ?v1))))

   (:action op_1
       :parameters (?v7 - type_1 ?v3 - object ?v6 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_2 ?v3 ?v6) (pred_4 ?v7 ?v6) (pred_1 ?v7 ?v2))
       :effect (and (pred_3 ?v7 ?v3 ?v2)
		    (not (pred_2 ?v3 ?v6)) 
		    (not (pred_1 ?v7 ?v2))))

   (:action op_2
       :parameters (?v7 - type_1 ?v3 - object ?v6 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_3 ?v7 ?v3 ?v2) (pred_4 ?v7 ?v6))
       :effect (and (pred_2 ?v3 ?v6)
		    (pred_1 ?v7 ?v2)
		    (not (pred_3 ?v7 ?v3 ?v2)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_04 - type_1
obj_03 obj_08 - type_3
obj_05 obj_10 obj_02 obj_01 - type_2
obj_06 obj_07 obj_09 - object)
(:init
(pred_4 obj_04 obj_01)
(pred_1 obj_04 obj_03)
(pred_1 obj_04 obj_08)
(pred_2 obj_06 obj_02)
(pred_2 obj_07 obj_01)
(pred_2 obj_09 obj_01)
)
(:goal
(and
(pred_2 obj_06 obj_02)
(pred_2 obj_07 obj_05)
(pred_2 obj_09 obj_02)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_04 ?b obj_03))))
)
)

; plan
1. (op_1 obj_04 obj_09 obj_01 obj_08)
   deleted: (pred_2 obj_09 obj_01) (pred_1 obj_04 obj_08)
   added: (pred_3 obj_04 obj_09 obj_08)
   goals met: 1 of 3
2. (op_3 obj_04 obj_01 obj_02)
   deleted: (pred_4 obj_04 obj_01)
   added: (pred_4 obj_04 obj_02)
   goals met: 1 of 3
3. (op_2 obj_04 obj_09 obj_02 obj_08)
   deleted: (pred_3 obj_04 obj_09 obj_08)
   added: (pred_2 obj_09 obj_02) (pred_1 obj_04 obj_08)
   goals met: 2 of 3
4. (op_3 obj_04 obj_02 obj_05)
   deleted: (pred_4 obj_04 obj_02)
   added: (pred_4 obj_04 obj_05)
   goals met: 2 of 3
5. (op_3 obj_04 obj_05 obj_01)
   deleted: (pred_4 obj_04 obj_05)
   added: (pred_4 obj_04 obj_01)
   goals met: 2 of 3
6. (op_1 obj_04 obj_07 obj_01 obj_08)
   deleted: (pred_2 obj_07 obj_01) (pred_1 obj_04 obj_08)
   added: (pred_3 obj_04 obj_07 obj_08)
   goals met: 2 of 3
7. (op_3 obj_04 obj_01 obj_05)
   deleted: (pred_4 obj_04 obj_01)
   added: (pred_4 obj_04 obj_05)
   goals met: 2 of 3
8. (op_2 obj_04 obj_07 obj_05 obj_08)
   deleted: (pred_3 obj_04 obj_07 obj_08)
   added: (pred_2 obj_07 obj_05) (pred_1 obj_04 obj_08)
   goals met: 3 of 3
